quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
/*
 * Connect to WiFi network using credentials from secrets.h.
 * Skips if already connected. Waits up to 15 seconds for connection.
 * setAutoReconnect + WiFi event handler keep the link up automatically after
 * this initial connect, so loop-level polling is just a fallback.
 */
void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED) // Skip if already connected
    return;

  Serial.printf("[WiFi] Connecting to network: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);         // Station mode
  WiFi.setAutoReconnect(true); // Auto reconnect on disconnect
  WiFi.persistent(true);       // Persist credentials to NVS
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] Connection failed — will retry later");
    WiFi.disconnect(true); // Clear stale state so next begin() is clean
    delay(100);
    WiFi.begin(WIFI_SSID,
               WIFI_PASSWORD); // Kick off a fresh attempt in the background
  }
}

// ========================== FIREBASE INITIALIZATION
// ===============================

/*
 * Initialize Firebase connection with API key, database URL, and user
 * credentials. Uses email/password authentication method. Called once during
 * setup().
 */
void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;     // Set Firebase project API key
  fbConfig.database_url = FIREBASE_DB_URL; // Set Firebase Realtime Database URL

  fbAuth.user.email = FIREBASE_USER_EMAIL;   // Set Firebase auth email
  fbAuth.user.password = FIREBASE_USER_PASS; // Set Firebase auth password

  fbConfig.token_status_callback =
      tokenStatusCallback; // Set callback for auth token status updates
  fbData.setBSSLBufferSize(
      2048, 2048); // Set SSL buffer size for secure communication

  Firebase.begin(&fbConfig,
                 &fbAuth);         // Initialize Firebase with config and auth
  Firebase.reconnectNetwork(true); // Enable automatic network reconnection

  Serial.println("[Firebase] Initialized — authenticating...");
}

// Exponential backoff: 2s → 4s → 8s → 16s → ... → 5min cap.
// Called after any Firebase.RTDB.set*() returns false.
void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak)); // 2s..~8min raw
  if (backoff > 300000UL)
    backoff = 300000UL; // cap at 5 min
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

// ========================== MODBUS READ WITH RETRY =========================
// Slave түр хариу өгөхгүй байгаа тохиолдлыг (intermittent failure)
// нэг удаагийн дахин оролдлогоор нөхнө. 9600 baud дээр нэг уншилт ~30ms тул
// дахин оролдлого + 50ms delay = ~80ms нэмж зарцуулна. Bus contention багатай
// үед энэ нь гол шалтгаан болж байгаа учир үр дүн өндөр.
bool readFloatRetry(uint8_t slave, uint16_t reg, float &out) {
  if (modbus.readFloat(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readFloat(slave, reg, out);
}

bool readTotalizerRetry(uint8_t slave, uint16_t reg, float &out) {
  if (modbus.readTotalizer(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readTotalizer(slave, reg, out);
}

bool readShortRetry(uint8_t slave, uint16_t reg, uint16_t &out) {
  if (modbus.readShort(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readShort(slave, reg, out);
}

// ========================== MODBUS RECOVERY =========================

/*
 * Escalating recovery when Modbus reads fail repeatedly:
 *   Level 1: modbus.recover() (UART restart + DE/RE toggle) — most common fix
 *   Level 2: hardware reboot via watchdog (last resort)
 */
void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);

  if (totalRecoveryAttempts >= cfg::MAX_TOTAL_RECOVERY_FAILS) {
    Serial.println("[Recovery] Max attempts reached — forcing reboot via WDT");
    delay(100);
    while (true) {
    } // Let watchdog reset the chip cleanly
  }

  modbus.recover();
  consecutiveReadFails = 0; // Give the bus a fresh chance
  Serial.println("[Recovery] RS485 bus re-initialized");
}

// ========================== SETUP (RUNS ONCE AT BOOT)
// ==================================

/*
 * Arduino setup function — runs once when ESP32 powers on or resets.
 * Initializes serial ports, RS485 transceiver, WiFi, Firebase, and watchdog
 * timer.
 */
void setup() {
  Serial.begin(115200); // Initialize debug serial port at 115200 baud
  delay(300);           // Brief delay for USB-CDC serial to stabilize
  Serial.println("\n========= Flowmeter IoT (S3-Zero x3) =========");

  led::begin();
  // LED runs on its own core 0 task so Modbus / Firebase blocking calls
  // on core 1 (Arduino loop) never freeze the blink animation.
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  // Modbus class дотор pinMode + digitalWrite + Serial1.begin бүгдийг хийнэ
  modbus.begin();
  Serial.printf(
      "[Modbus] Initialized — Flowmeter 1: Slave %d, Flowmeter 2: Slave %d, "
      "Flowmeter 3: Slave %d\n",
      cfg::FM1_SLAVE, cfg::FM2_SLAVE, cfg::FM3_SLAVE);

  WiFi.onEvent(onWifiEvent); // Register auto-reconnect event handler BEFORE
                             // first connect
  wifiConnect();             // Connect to WiFi network
  firebaseInit();            // Initialize Firebase connection

  // Configure ESP32 hardware watchdog timer to reset the chip if code hangs
  esp_task_wdt_config_t wdtConfig = {
      .timeout_ms = cfg::WDT_TIMEOUT_S * 1000, // Timeout in milliseconds
      .idle_core_mask = 0,                // Don't watch idle tasks
      .trigger_panic = true};             // Reset ESP32 on timeout
  esp_task_wdt_reconfigure(&wdtConfig);   // Apply watchdog configuration
  esp_task_wdt_add(NULL); // Add current task to watchdog monitoring
  Serial.printf("[WDT] Watchdog started — %d second timeout\n",
                cfg::WDT_TIMEOUT_S);
}

// ========================== MAIN LOOP (RUNS REPEATEDLY) =================

