quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
/*
 * Arduino loop function — runs continuously after setup().
 * Reads both flowmeters via Modbus RTU and uploads values to Firebase.
 * Includes WiFi reconnection logic and watchdog timer reset.
 */
void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ---- Long-running stability watchdog ----
  // Heap fragmentation (Firebase TLS буфер, FirebaseJson allocation г.м.) удаан
  // ажиллах тусам хуримтлагдаж тогтворгүй болгож болзошгүй. 2 хамгаалалт:
  //   1) 5 минут тутам free heap-г log хийнэ — graphana/serial monitor дээр
  //      санах ой буурч буй эсэхийг харж болно.
  //   2) Free heap нь босгоос (20KB) доош унавал, эсвэл uptime 24 цаг хэтэрвэл
  //      cleaн restart хийж бүх ресурсыг чөлөөлнө. ESP.restart() нь
  //      крашгүй perezagruz хийдэг — Firebase, ota::loop хувилбаруудаас
  //      найдвартай. WiFi/Firebase setup() дээр дахин эхэлнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u bytes | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // Fallback WiFi polling — onWifiEvent/setAutoReconnect handle most cases,
  // but we retry manually if the connection has been down for cfg::WIFI_RETRY_MS.
  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    wifiConnect();
  }

  // Rate limit: 2 секунд тутамд нэг cycle (READ_INTERVAL_MS)
  if (now - lastReadTime < cfg::READ_INTERVAL_MS)
    return;
  lastReadTime = now;

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // Modbus bus-н ачааллыг бууруулж, "хоёуланг нь зэрэг уншихгүй" гэсэн
  // шаардлагыг хангахын тулд totalizer-ийг тусад нь minute-тэй уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд
  float flow1 = 0.0f, flow2 = 0.0f, flow3 = 0.0f;
  float total1 = 0.0f, total2 = 0.0f, total3 = 0.0f;
  bool okFlow1 = false, okFlow2 = false, okFlow3 = false;
  bool okTotal1 = false, okTotal2 = false, okTotal3 = false;

  if (totalizerCycle) {
    // ---- Totalizer cycle: 3 flowmeter-ийн totalizer-ийг л унших ----
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    okTotal1 = readTotalizerRetry(cfg::FM1_SLAVE, cfg::REG_TOTALIZER, total1);
    if (okTotal1) { cachedTotal1 = total1; cachedTotal1Valid = true; }
    delay(50);

    okTotal2 = readTotalizerRetry(cfg::FM2_SLAVE, cfg::REG_TOTALIZER, total2);
    if (okTotal2) { cachedTotal2 = total2; cachedTotal2Valid = true; }
    delay(50);

    okTotal3 = readTotalizerRetry(cfg::FM3_SLAVE, cfg::REG_TOTALIZER, total3);
    if (okTotal3) { cachedTotal3 = total3; cachedTotal3Valid = true; }
    delay(50);

    Serial.printf("[Totalizer] FM1:%.3f(%d) FM2:%.3f(%d) FM3:%.3f(%d) m3\n",
                  total1, okTotal1, total2, okTotal2, total3, okTotal3);
  } else {
    // ---- Flow cycle: 3 flowmeter-ийн flow rate-ийг л унших ----
    okFlow1 = readFloatRetry(cfg::FM1_SLAVE, cfg::REG_FLOW_RATE, flow1);
    delay(50);
    okFlow2 = readFloatRetry(cfg::FM2_SLAVE, cfg::REG_FLOW_RATE, flow2);
    delay(50);
    okFlow3 = readFloatRetry(cfg::FM3_SLAVE, cfg::REG_FLOW_RATE, flow3);
    delay(50);

    Serial.printf("[Flow] FM1:%.3f(%d) FM2:%.3f(%d) FM3:%.3f(%d) m3/h\n",
                  flow1, okFlow1, flow2, okFlow2, flow3, okFlow3);
  }

  // ---- Read Ultrasonic Level Transmitter (Slave ID 1) ----
  // Register 0x2002 = Level instantaneous (uint16, decimal=3 → /1000 = m).
  // Level нь нэг л register учир хоёр төрлийн цикл-д унших — bus-д бараг
  // ачаалал өгөхгүй.
  uint16_t levelRaw = 0;
  bool okLevel = readShortRetry(cfg::ULS_SLAVE, cfg::REG_ULS_LEVEL, levelRaw);
  float ulsLevel = okLevel ? (levelRaw / 1000.0f) : 0.0f;

  if (okLevel)
    Serial.printf("[ULS] Level: %.3f m\n", ulsLevel);
  else
    Serial.println("[ULS] Read failed");

  // Mount height-г нэг л удаа (амжилттай болтол cycle бүрт оролдоно) уншина.
  if (!ulsMountKnown) {
    uint16_t mountRaw = 0;
    if (readShortRetry(cfg::ULS_SLAVE, cfg::REG_ULS_MOUNT, mountRaw) && mountRaw > 0) {
      ulsMountM = mountRaw / 1000.0f;
      ulsMountKnown = true;
      Serial.printf("[ULS] Mount height: %.3f m\n", ulsMountM);
    }
  }

  // ---- Track read failures and escalate recovery if needed ----
  bool anyReadOk = okFlow1 || okFlow2 || okFlow3 ||
                   okTotal1 || okTotal2 || okTotal3 || okLevel;
  if (anyReadOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_READ_FAILS) {
      recoverModbusBus();
    }
  }

  // WiFi сүлжээ байхгүй бол улаан анивчина — Firebase ямартай ч ажиллахгүй.
  if (WiFi.status() != WL_CONNECTED) {
    led::setMode(led::SLOW_RED);
    return;
  }

  // ---- Upload to Firebase (single multi-path PATCH → 1 HTTP request) ----
  // 6-7 setFloat дуудлагыг нэг updateNode болгож хувиргав. RS485 + 3 sensor
  // дуусаад нэг л HTTPS round-trip — loop iteration ~1.5s → ~0.7s болсон.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] Ready");
    ota::begin(&fbData); // DEVICE_ID register + командын stream нээх
  }

  FirebaseJson json;
  bool anyWrite = false;

  if (totalizerCycle) {
    // Зөвхөн totalizer-уудыг шинэчилнэ. Амжилтгүй уншилт бол cache-ийг
    // өмнөх утга дээр үлдээгээд бичихгүй (хуучин зөв утгыг 0-р дарж болохгүй).
    if (okTotal1) { json.set("flowmeter1/totalizer", cachedTotal1); anyWrite = true; }
    if (okTotal2) { json.set("flowmeter2/totalizer", cachedTotal2); anyWrite = true; }
    if (okTotal3) { json.set("flowmeter3/totalizer", cachedTotal3); anyWrite = true; }
  } else {
    if (okFlow1) { json.set("flowmeter1/flow_rate", flow1); anyWrite = true; }
    if (okFlow2) { json.set("flowmeter2/flow_rate", flow2); anyWrite = true; }
    if (okFlow3) { json.set("flowmeter3/flow_rate", flow3); anyWrite = true; }
  }
  if (okLevel)  { json.set("level_sensor/level", ulsLevel); anyWrite = true; }
  // Mount height-г нэг удаа нийтэлнэ (амжилттай upload болтол дахин оролдоно).
  if (ulsMountKnown && !ulsMountSent) { json.set("level_sensor/mount_height", ulsMountM); anyWrite = true; }

  bool uploadOk = false;
  if (!anyWrite) {
    // Modbus бүх 3 sensor энэ cycle-д хариу өгсөнгүй → улаан
    led::setMode(led::SLOW_RED);
  } else {
    json.set("last_updated", (int)(millis() / 1000));

    if (Firebase.RTDB.updateNode(&fbData, "/flow_system", &json)) {
      Serial.println("[Firebase] Updated");
      fbOnSuccess();
      led::setMode(led::OFF);
      led::pulse(); // upload бүрд нэг ногоон импульс — terminal-той synchron
      uploadOk = true;
      if (ulsMountKnown) ulsMountSent = true; // mount height нийтлэгдсэн

    } else {
      Serial.printf("[Firebase] update ERROR: %s\n", fbData.errorReason().c_str());
      fbOnFailure();
      led::setMode(led::SLOW_RED);
    }
  }

  // OTA heartbeat + progress publish + command stream tick.
  // Firebase ready болсон бөгөөд upload амжилттай эсэхийг дамжуулна —
  // self-test шалгуурт ашиглана.
  ota::loop(&fbData, uploadOk);
}
